src/InformationRegisters/СостоянияЗапросовКоммерческихПредложений/СостоянияЗапросовКоммерческихПредложений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияЗапросовКоммерческихПредложений</name>
  <resources>
    <name>ТекущееСостояние</name>
    <type>
      <types>EnumRef.СостоянияЗапросаКоммерческихПредложений</types>
    </type>
  </resources>
  <resources>
    <name>НовоеСостояние</name>
    <type>
      <types>EnumRef.СостоянияЗапросаКоммерческихПредложений</types>
    </type>
  </resources>
  <resources>
    <name>Действие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЗапросКоммерческихПредложений</name>
    <type>
      <types>DocumentRef.ЗапросКоммерческихПредложенийПоставщиков</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СостоянияЗапросовКоммерческихПредложений/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает структуру значений по умолчанию для документа для движений.
//
// Параметры:
//   СсылкаНаОформляемыйДокумент - ОпределяемыйТип.ЗапросКоммерческихПредложенийПоставщиков - ссылка на документ.
//
// Возвращаемое значение:
//    Структура - значения по умолчанию
//
Функция ЗначенияПоУмолчанию(СсылкаНаОформляемыйДокумент) Экспорт
	
	СтруктураЗначенияПоУмолчанию = Новый Структура;
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(СсылкаНаОформляемыйДокумент);
	
	СтруктураЗначенияПоУмолчанию.Вставить("ЗапросКоммерческихПредложений"         , СсылкаНаОформляемыйДокумент);
	СтруктураЗначенияПоУмолчанию.Вставить("ТекущееСостояние" , МенеджерОбъекта.СтатусПоУмолчанию());
	СтруктураЗначенияПоУмолчанию.Вставить("НовоеСостояние"   , МенеджерОбъекта.СтатусПоУмолчанию());
	СтруктураЗначенияПоУмолчанию.Вставить("Действие"         , "");
	
	Возврат СтруктураЗначенияПоУмолчанию;
	
КонецФункции

// Возвращает текущее состояние запроса коммерческих предложений по ссылке.
//
// Параметры:
//   ЗапросКоммерческихПредложений - ОпределяемыйТип.ЗапросКоммерческихПредложенийПоставщиков - ссылка на документ.
//
// Возвращаемое значение:
//	Структура - текущее состояние запроса коммерческих предложений
//
Функция ТекущееСостояние(ЗапросКоммерческихПредложений) Экспорт
	
	ВозвращаемоеЗначение = ЗначенияПоУмолчанию(ЗапросКоммерческихПредложений);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СостоянияЗапросовКоммерческихПредложений.ЗапросКоммерческихПредложений КАК ЗапросКоммерческихПредложений,
	|	СостоянияЗапросовКоммерческихПредложений.ТекущееСостояние КАК ТекущееСостояние,
	|	СостоянияЗапросовКоммерческихПредложений.НовоеСостояние КАК НовоеСостояние,
	|	СостоянияЗапросовКоммерческихПредложений.Действие КАК Действие
	|ИЗ
	|	РегистрСведений.СостоянияЗапросовКоммерческихПредложений КАК СостоянияЗапросовКоммерческихПредложений
	|ГДЕ
	|	СостоянияЗапросовКоммерческихПредложений.ЗапросКоммерческихПредложений = &ЗапросКоммерческихПредложений");
	
	Запрос.УстановитьПараметр("ЗапросКоммерческихПредложений", ЗапросКоммерческихПредложений);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ВозвращаемоеЗначение, Выборка);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Выполняет обновление статуса запроса коммерческих предложений.
//
// Параметры:
//   Документ            - ОпределяемыйТип.ЗапросКоммерческихПредложенийПоставщиков - ссылка на документ.
//   ПараметрыОбновления - Структура - параметры обновления регистра см. ресурсы регистра.
//
// Возвращаемое значение:
//    Булево - запись произведена успешно
//
Функция ЗаписатьСтатус(Документ, ПараметрыОбновления) Экспорт
	
	Результат = Истина;
	
	МенеджерЗаписи = РегистрыСведений.СостоянияЗапросовКоммерческихПредложений.СоздатьМенеджерЗаписи();
	
	СтруктураЗаписи = ЗначенияПоУмолчанию(Документ);
	
	ЗаполнитьЗначенияСвойств(СтруктураЗаписи, ПараметрыОбновления);
	
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураЗаписи);
	
	НачатьТранзакцию();
	Попытка
		МенеджерЗаписи.Записать(Истина);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Информация = ИнформацияОбОшибке();
		
		ЭлектронноеВзаимодействие.ОбработатьОшибку(НСтр("ru = 'Записать статус запроса коммерческих предложений';
														|en = 'Record the status of request for quotation'"), ПодробноеПредставлениеОшибки(Информация), 
			НСтр("ru = 'Не удалось записать статус запроса коммерческих предложений';
				|en = 'Cannot save the status of request for quotation'"), "БизнесСеть");
			
		Результат = Ложь;
	КонецПопытки;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#КонецЕсли
